In [3]:
from pandas import Series, DataFrame
import pandas as pd
pd.__version__

'0.22.0'

Series

In [5]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3], index =['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']
obj2[0]

4

In [11]:
type(obj2[['a','c','d']])

pandas.core.series.Series

In [12]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [13]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
data = {'state' : ['ohio','ohio','ohio','nevada','nevada'],
       'year' : [2000,2001,2002,2001,2002],
       'pop' : [1.5,1.7,3.6,2.4,2.9]}
type(data)

dict

In [24]:
frame=DataFrame(data)
frame.head()

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [49]:
frame1 = DataFrame(data, columns=['year','state','pop','debt'], 
                   index = ['one', 'two', 'three', 'four', 'five'])
frame1.head()

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

In [50]:
frame1.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [51]:
type(frame['state'])

pandas.core.series.Series

In [52]:
type(frame.state)

pandas.core.series.Series

In [54]:
frame1.ix['three']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [55]:
frame1.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [57]:
frame1.iloc[2]

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [58]:
frame1['debt'] = 16.5 # broadcasting

In [59]:
frame1

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5

In [62]:
frame1['eastern'] = frame1.state == 'ohio'
frame1

       year   state  pop  debt  eastern
one    2000    ohio  1.5  16.5     True
two    2001    ohio  1.7  16.5     True
three  2002    ohio  3.6  16.5     True
four   2001  nevada  2.4  16.5    False
five   2002  nevada  2.9  16.5    False

In [63]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [64]:
frame3 = DataFrame(pop)

In [65]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [66]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [67]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [68]:
with open("ex1.csv")

SyntaxError: invalid syntax (<ipython-input-68-98dfea150c06>, line 1)

In [71]:
fdf = pd.read_csv("ex1.csv")

In [72]:
fdf

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [73]:
fdf.iloc[0]

a              1
b              2
c              3
d              4
message    hello
Name: 0, dtype: object

In [75]:
fdf.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

## 헤더 정보가 없을때

In [81]:
#fdf1 = pd.read_csv("ex2.csv",header=None)
fdf1 = pd.read_csv("ex2.csv",names=['a','b','c','d','message'])

In [82]:
fdf1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [83]:
index = fdf1.index
index

RangeIndex(start=0, stop=3, step=1)

In [85]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [88]:
index = pd.Index(np.arange(3))

In [90]:
obj2 = Series([4,5,6], index=index)

In [98]:
obj2

0    4
1    5
2    6
dtype: int64

In [92]:
obj2.index is index

True

In [93]:
'Ohio' in frame3.columns

True

In [94]:
2003 in frame3.columns

False

In [104]:
obj3 = obj2.reindex([2,4,8], fill_value=0)

In [105]:
obj3

2    6
4    0
8    0
dtype: int64

In [108]:
# 순차적인 인덱스 생성
obj3.reindex(range(8), method='ffill')

0    NaN
1    NaN
2    6.0
3    6.0
4    0.0
5    0.0
6    0.0
7    0.0
dtype: float64

In [ ]:
컬럼탐색 - df['컬럼명'], df.컬럼명
행기준탐색 - df.iloc[], df.loc[]